Catalogs/ВидыОповещенийПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыОповещенийПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОповещенийПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставляемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонТекстаОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияКэша</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогГруппировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСгруппированногоОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсточникиДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипИсточника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОповещенийПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОповещенийПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оперативное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неоперативное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыОповещенийПользователей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Поставляемый = Ложь;
	Активен = Ложь;
	Изменен = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ТипОповещения = Перечисления.ТипыОповещенийПользователей.Неоперативное Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИсточникиДанных");
	ИначеЕсли ТипОповещения = Перечисления.ТипыОповещенийПользователей.Оперативное Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТекстСгруппированногоОповещения");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	Если НЕ ЭтоГруппа И Активен И НЕ Обсуждения.СистемаВзаимодействийПодключена() Тогда
		ТекстОшибки = НСтр("ru = 'Обсуждения системы взаимодействия недоступны. Вид оповещения не может быть активным.';
							|en = 'Collaboration system notifications are not available. The notification kind cannot be active.'");
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"Активен",
			,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ЭтоГруппа И ТипОповещения = Перечисления.ТипыОповещенийПользователей.Неоперативное Тогда
		ИсточникиДанных.Очистить();
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И Активен Тогда
		
		Если ИмяШаблонаСКД = ОповещенияПользователейОСобытиях.ИмяПредопределенногоШаблона() Тогда
			СКД = СхемаКомпоновкиДанных.Получить();
			Если СКД = Неопределено 
				ИЛИ НЕ ОповещенияПользователейОСобытиях.ЕстьИзменения(СКД, ОповещенияПользователейОСобытиях.МакетПоПолномуИмени(ИмяШаблонаСКД)) Тогда
				ТекстОшибки = НСтр("ru = 'Не настроен запрос получения данных оповещения. Вид оповещения не может быть активным.';
									|en = 'The request for notification data is not configured. The notification kind cannot be active.'");
				
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					"Активен",
					,
					Отказ);
			КонецЕсли;
		КонецЕсли;
		
		ОповещенияПользователейОСобытиях.ПроверкаКорректностиСхемыПолученияДанныхПередЗаписью(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И Поставляемый И Не Изменен Тогда
		ОписаниеВидаОповещений = ОповещенияПользователейОСобытиях.ОписаниеВидаОповещенийПользователейПоИдентификатору(Ссылка.УникальныйИдентификатор());
		Если ОписаниеВидаОповещений <> Неопределено Тогда
			Если СхемаКомпоновкиДанных.Получить() <> Неопределено
				Или ХранилищеНастроекКомпоновкиДанных.Получить() <> Неопределено Тогда
				
				Изменен = Истина;
				
			КонецЕсли;
			
			Если НЕ Изменен Тогда
				ОсновныеРеквизитыВидаОповещений = ОповещенияПользователейОСобытиях.ОсновныеРеквизитыВидаОповещений();
				Для Каждого ИмяРеквизита Из ОсновныеРеквизитыВидаОповещений Цикл
					Если ОписаниеВидаОповещений[ИмяРеквизита] <> ЭтотОбъект[ИмяРеквизита] Тогда
						Изменен = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если НЕ Изменен Тогда
				Для каждого СтрокаИсточник Из ОписаниеВидаОповещений.ИсточникиДанных Цикл
					Если ТипЗнч(СтрокаИсточник.ТипИсточника) = Тип("Строка") Тогда
						СтрокаИсточникТипИсточника = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(СтрокаИсточник.ТипИсточника);
					Иначе
						СтрокаИсточникТипИсточника = СтрокаИсточник.ТипИсточника;
					КонецЕсли;
					СтруктураПоиска = Новый Структура("ТипИсточника, РеквизитИсточника",
						СтрокаИсточникТипИсточника,
						СтрокаИсточник.РеквизитИсточника);
						
					Если ИсточникиДанных.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
						Изменен = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если НЕ ЭтоГруппа И Активен И Обсуждения.СистемаВзаимодействийПодключена() Тогда
		УстановитьПривилегированныйРежим(Истина);
		Отбор = Новый Структура();
		Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОповещенияПользователейОСобытиях);
		Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
		Если Задания.Количество() = 1 Тогда
			Если НЕ Задания[0].Использование Тогда
				Параметры = Новый Структура();
				Параметры.Вставить("Использование", Истина);
				РегламентныеЗаданияСервер.ИзменитьЗадание(Задания[0].УникальныйИдентификатор, Параметры);
			КонецЕсли;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
